Revit 2027 API
EnergyDataSettings.OutsideAirPerArea Property
Note: This API is now obsolete.
 The rate of flow of outside air available per unit area.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public double OutsideAirPerArea { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property OutsideAirPerArea As Double
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property double OutsideAirPerArea {
	double get ();
	void set (double value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member OutsideAirPerArea : float with get, set
Property Value
Double
Remarks
 Stored in cubic feet per hour per square foot.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace